<a href="https://colab.research.google.com/github/poonamkhot123/Linear-Regression/blob/main/Pandas_coding_with_sagar.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
# How to create a dataframe.
data = {"name":['ram','shyam','ghanshyam'],
        "Age":[10,20,30],
        "city":['pune','nagpur','baramati']
        }

In [4]:
df = pd.DataFrame(data)
print(df)

        name  Age      city
0        ram   10      pune
1      shyam   20    nagpur
2  ghanshyam   30  baramati

In [5]:
# save above file in csv formate.
df.to_csv("output.csv",index=False)

In [6]:
# save above file in excel formate.
df.to_excel("output.xlsx",index=False)

In [7]:
# save above file in JSON formate.
df.to_json("output.json",index = False)

In [8]:
print(df.head())

        name  Age      city
0        ram   10      pune
1      shyam   20    nagpur
2  ghanshyam   30  baramati

In [9]:
print(df.tail())

        name  Age      city
0        ram   10      pune
1      shyam   20    nagpur
2  ghanshyam   30  baramati

In [10]:
#v gives summary or description of data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [11]:
data = {
    "Name":['poonam','shravani','manisha','sejal'],
    "Age":[10,20,30,40],
    "City":['pune','nagpur','baramati','mumbai'],
    "performance score":[85,90,78,92]

}

In [12]:
df = pd.DataFrame(data)
print(df)

       Name  Age      City  performance score
0    poonam   10      pune                 85
1  shravani   20    nagpur                 90
2   manisha   30  baramati                 78
3     sejal   40    mumbai                 92

In [13]:
print("Descriptive statistics")
print(df.describe())

Descriptive statistics
             Age  performance score
count   4.000000           4.000000
mean   25.000000          86.250000
std    12.909944           6.238322
min    10.000000          78.000000
25%    17.500000          83.250000
50%    25.000000          87.500000
75%    32.500000          90.500000
max    40.000000          92.000000

In [18]:
print(df.shape)

(4, 4)

In [23]:
print(df.columns)

Index(['Name', 'Age', 'City', 'performance score'], dtype='object')

In [24]:
# selecting columns
print(df['Name'])

0      poonam
1    shravani
2     manisha
3       sejal
Name: Name, dtype: object

In [25]:
# selecting multiple columns
print(df[["Name","Age"]])

       Name  Age
0    poonam   10
1  shravani   20
2   manisha   30
3     sejal   40

In [27]:
# select column based on single condition
print(df[df["Age"]>20])

      Name  Age      City  performance score
2  manisha   30  baramati                 78
3    sejal   40    mumbai                 92

In [14]:
print(df[df["performance score"]>85])

       Name  Age    City  performance score
1  shravani   20  nagpur                 90
3     sejal   40  mumbai                 92

In [15]:
data = {
    "Name" : [ "poonam","sahil","manisha","komal","Aditi","sejal"],
    "Age":[23,32,45,32,12,34],
    "Salary":[50000,60000,45000,32000,54000,32000],
    "Performance_Score":[85,90,78,88,80,89]
}

In [17]:
df = pd.DataFrame(data)
print(df)

      Name  Age  Salary  Performance_Score
0   poonam   23   50000                 85
1    sahil   32   60000                 90
2  manisha   45   45000                 78
3    komal   32   32000                 88
4    Aditi   12   54000                 80
5    sejal   34   32000                 89

In [18]:
df["Bonus"] = df["Salary"] * 0.1
print(df)

      Name  Age  Salary  Performance_Score   Bonus
0   poonam   23   50000                 85  5000.0
1    sahil   32   60000                 90  6000.0
2  manisha   45   45000                 78  4500.0
3    komal   32   32000                 88  3200.0
4    Aditi   12   54000                 80  5400.0
5    sejal   34   32000                 89  3200.0